zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
	}
	return error;
}

static void file_move_to_destination(char *file_path,FileType type)
{
	char old_file[MAX_FILE_PATH_SIZE]={0};
	unsigned char old_md5[MD5_SIZE] = { 0 };
	unsigned char new_md5[MD5_SIZE] = { 0 };
	unsigned char file_Dev = SYSDISK;
	unsigned long file_len = 0;
	FRESULT error;

	strncpy(old_file,file_path,strlen(file_path));
	memset(file_path,0,MAX_FILE_PATH_SIZE);
	switch(type){
		case upgrade_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", UPGRADE_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case schedule_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", SCHEDULE_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case picture_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"%s/%s", PIC_FILE_DIR,strrchr(old_file,'/')+1);
			break;

		case voice_file:
			snprintf(file_path,MAX_FILE_PATH_SIZE,"/%s", strrchr(old_file,'/')+1);
			file_Dev = MP3DISK;
			break;

		default:
			dzlog_error("%s:recv unknown file type %d ???\r\n",__func__,type);
			return;
	}

#ifdef PRIVATE_MP3_FLASH_FS
	if(type == voice_file){
		file_len = get_file_size(SYSDISK,old_file);
		if(PrivateMp3PlayerValidFileSize(file_len)){
			PrivateMp3PlayerSaveFile(old_file);
		}
		else{
			dzlog_error("%s:file size '%d' too large,deny to save !!!\r\n",__func__,file_len);
		}
		ff_unlink(SYSDISK,old_file);
		return;
	}
#endif

	again:
	error = ff_rename(file_Dev,old_file,file_path);
	if(error){
		//fail
		dberr("%s: rename file '%s' to '%s' error=%d\r\n",__func__,old_file,file_path,error);
		if(error == FR_EXIST){	//file exist !
			get_md5(file_Dev,old_md5, old_file, 0);
			get_md5(file_Dev,new_md5, file_path, 0);
			if (0 != memcmp(old_md5, new_md5, MD5_SIZE)) {
				dzlog_error("%s:not the same file,remove '%s',try again...\r\n",__func__,file_path);
				ff_unlink(file_Dev,file_path);
				goto again;
			}
			else{
				dzlog_debug("%s:the same file,ignore rename to '%s'...\r\n",__func__,file_path);
				ff_unlink(file_Dev,old_file);
			}
		}
	}
	else{
		//ok
		dberr("%s: rename file '%s' to '%s' sucessful\r\n",__func__,old_file,file_path);
	}
	return;
}

static osStatus jd_master_com_send_exception_response(jd_om_comm *hdl,unsigned char type, void *data)
{
	int payload_size;
	unsigned char res_type;
	osStatus ret;

	res_type = (type&0x0F)|0xA0;
	payload_size = sizeof(RES_COMMON_T);

	int packet_size = sizeof(MSG_UART_HEAD_T) + payload_size + CHECKSUM_SIZE;
	MSG_UART_PACKAGE_T *pkt = jd_om_malloc(packet_size);

	pkt->head.start = START_CMD;
	pkt->head.slave = SLAVE_1;
	pkt->head.type = res_type;
	pkt->head.payload_len = payload_size;

	memcpy((char *)pkt + sizeof(MSG_UART_HEAD_T), (char *)data, payload_size);

	unsigned short chksum = crc16((char *)pkt, packet_size - CHECKSUM_SIZE);
	memcpy((char *)pkt + packet_size - CHECKSUM_SIZE, &chksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(uart_comm_des.send_queue), (void *)pkt);
	if (osErrorOS == ret)
		dzlog_error("res[%02x] to queue error\r\n", res_type);

	return ret;
}
#endif
int uart_sent_dumb()
{
	int ret = -1;
	int payload_len = 512;
	int pkt_len = sizeof(MSG_UART_HEAD_T) + payload_len + CHECKSUM_SIZE;
	static u32 packetid = 0;
	unsigned char *pt = jd_om_malloc(pkt_len);

	MSG_UART_HEAD_T *head = (MSG_UART_HEAD_T *)pt;

	head->start = START_CMD;
	head->type = RES_GET_TIME;
	head->payload_len = payload_len;
	head->packet_id = packetid++;

	memset(pt + sizeof(MSG_UART_HEAD_T), 0xde, payload_len);

	unsigned short checksum = crc16((char *)pt, pkt_len - CHECKSUM_SIZE);
	memcpy((char *)pt + pkt_len - CHECKSUM_SIZE, &checksum, CHECKSUM_SIZE);

	ret = jd_om_mq_send(&(uart_comm_des.send_queue), (void *)pt);
	if (ret) {
		dzlog_error("%s send msg error\n", __func__);
		jd_om_free(pt);
	}

	return 0;
}

u8 get_packet_id()
{
	static unsigned char uart_packet_id = 0;
	return uart_packet_id++;
}


int wait_battery_response(EventBits_t bat_evt, TickType_t timeout)
{
	EventBits_t bits;
	xEventGroupClearBits(BatteryResEvents, bat_evt);
	bits = xEventGroupWaitBits(BatteryResEvents, bat_evt, (BaseType_t)pdTRUE, (BaseType_t)pdTRUE, timeout);
	if (bits & bat_evt) {
		return 0;
	} else {
		dzlog_error("######## wait event %ld err %ld\r\n", bat_evt, bits);
		return -1;
	}
}


#define SECONDS_IN_A_DAY (86400U)
#define SECONDS_IN_A_HOUR (3600U)
#define SECONDS_IN_A_MINUTE (60U)
#define DAYS_IN_A_YEAR (365U)
#define YEAR_RANGE_START (1970U)
#define YEAR_RANGE_END (2099U)
#if 0
static void RTC_ConvertSecondsToDatetime(uint32_t seconds, rtc_datetime_t *datetime)
{
    assert(datetime);

    uint32_t x;
    uint32_t secondsRemaining, days;
    uint16_t daysInYear;
    /* Table of days in a month for a non leap year. First entry in the table is not used,
     * valid months start from 1
     */
    uint8_t daysPerMonth[] = {0U, 31U, 28U, 31U, 30U, 31U, 30U, 31U, 31U, 30U, 31U, 30U, 31U};

    /* Start with the seconds value that is passed in to be converted to date time format */
    secondsRemaining = seconds;

    /* Calcuate the number of days, we add 1 for the current day which is represented in the
     * hours and seconds field
     */
    days = secondsRemaining / SECONDS_IN_A_DAY + 1;

    /* Update seconds left*/
    secondsRemaining = secondsRemaining % SECONDS_IN_A_DAY;

    /* Calculate the datetime hour, minute and second fields */
    datetime->hour = secondsRemaining / SECONDS_IN_A_HOUR;
    secondsRemaining = secondsRemaining % SECONDS_IN_A_HOUR;
    datetime->minute = secondsRemaining / 60U;
    datetime->second = secondsRemaining % SECONDS_IN_A_MINUTE;

    /* Calculate year */
    daysInYear = DAYS_IN_A_YEAR;
    datetime->year = YEAR_RANGE_START;
    while (days > daysInYear)
    {
        /* Decrease day count by a year and increment year by 1 */
        days -= daysInYear;
        datetime->year++;

        /* Adjust the number of days for a leap year */
        if (datetime->year & 3U)
        {
            daysInYear = DAYS_IN_A_YEAR;
        }
        else
        {
            daysInYear = DAYS_IN_A_YEAR + 1;
        }
    }

    /* Adjust the days in February for a leap year */
    if (!(datetime->year & 3U))
    {
        daysPerMonth[2] = 29U;
    }

    for (x = 1U; x <= 12U; x++)
    {
        if (days <= daysPerMonth[x])
        {
            datetime->month = x;
            break;
        }
        else
        {
            days -= daysPerMonth[x];
        }
    }

    datetime->day = days;
}

static void jd_master_com_set_system_time(uint32_t timeSeconds)
{
	rtc_datetime_t date;
	uint32_t seconds = 0;

	seconds = timeSeconds + (60*60*8);	//transfer UTC to BeiJing Time.
	RTC_ConvertSecondsToDatetime(seconds, &date);

    /* RTC time counter has to be stopped before setting the date & time in the TSR register */
    RTC_StopTimer(RTC);

    /* Set RTC time to default */
    RTC_SetDatetime(RTC, &date);

    /* Enable at the NVIC */
    EnableIRQ(RTC_IRQn);

    /* Start the RTC time counter */
    RTC_StartTimer(RTC);
}

static uint32_t jd_master_com_get_system_time_second(void)
{
	uint32_t currSeconds = 0;

	//transfer current seconds to UTC time.
	currSeconds = RTC->COUNT - (60*60*8);	//transfer BeiJing Time to UTC.
	return currSeconds;
}

static void jd_master_com_clear_communication_cipher(void)
{
	uint32_t eeprom_data = 0x00000000U;
	int i=0;

