zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
			if (res->sn_len <= sizeof(res->sn)) {
			dzlog_debug("++++++get battery info sn len %d sn %s temp %d vol_h %d vol_l %d ratio %d\r\n",
				res->sn_len,		//sn 有效长度
				res->sn,		//sn
				res->Temp,			//温度: 16进制温度值（单位：摄氏度�?偏移�?40(避免负温�?
				res->Vol_H,		//电压：高�?
				res->Vol_L,		//电压：低�?
				res->ratio);		//16进制
			} else {
				dzlog_error("++++++get battery info invalid battery sn len %d\r\n", res->sn_len);
			}

			memcpy(&br_get_info, res, sizeof(RES_BAT_GET_INFO_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_GET_INFO);
			break;
		}
		case RES_BAT_ENCODE:
		{
			if (payload_len != sizeof(RES_BAT_ENCODE_T)) {
				goto WRONG_PAYLOAD_LEN;
			}
			RES_BAT_ENCODE_T *res = (RES_BAT_ENCODE_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery encode res %d\r\n", res->code);
			memcpy(&br_encode, res, sizeof(RES_BAT_ENCODE_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_ENCODE);
			break;
		}
		case RES_BAT_DECODE:
		{
			if (payload_len != sizeof(RES_BAT_DECODE_T)) {
				goto WRONG_PAYLOAD_LEN;
			}
			RES_BAT_DECODE_T *res = (RES_BAT_DECODE_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery decode res %d \r\n", res->code);
			memcpy(&br_decode, res, sizeof(RES_BAT_DECODE_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_DECODE);
			break;
		}
		case RES_BAT_VIRTUAL_PWR_INFO:
		{

			if (payload_len != sizeof(RES_BAT_VIRTUAL_PWR_T)) {
				goto WRONG_PAYLOAD_LEN;
			}
			RES_BAT_VIRTUAL_PWR_T *res = (RES_BAT_VIRTUAL_PWR_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery virtual info cnt1 %d cnt2 %d ratio %d last %d discharging %d \r\n",
				res->data[0], res->data[1], res->data[2], res->data[3], res->data[4]);

			memcpy(&br_virt_info, res, sizeof(RES_BAT_VIRTUAL_PWR_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_VIRT_PWR_INFO);
			break;
		}
		case RES_BAT_DISCHARGE_LEVEL:
		{
			if (payload_len != sizeof(RES_BAT_DISCHARGE_LEVEL_T)) {
				goto WRONG_PAYLOAD_LEN;
			}
			RES_BAT_DISCHARGE_LEVEL_T *res = (RES_BAT_DISCHARGE_LEVEL_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery discharge level res %d\r\n", res->code);
			memcpy(&br_dis_level, res, sizeof(RES_BAT_DISCHARGE_LEVEL_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_DISCHG_LEVEL);
			break;
		}
		case RES_BAT_CHARGE_STATUS:
		{
			if (payload_len != sizeof(RES_BAT_CHARGE_STATUS_T)) {
				goto WRONG_PAYLOAD_LEN;
			}
			RES_BAT_CHARGE_STATUS_T *res = (RES_BAT_CHARGE_STATUS_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery charge status level %d status %d\r\n", res->data[0], res->data[1]);
			memcpy(&br_chg_stat, res, sizeof(RES_BAT_CHARGE_STATUS_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_CHARGE_STAT);
			break;
		}
		case RES_BAT_PROTOCAL_VERSION:
		{
			if (payload_len != sizeof(RES_BAT_PROTOCAL_VERSION_T)) {
				goto WRONG_PAYLOAD_LEN;
			}
			RES_BAT_PROTOCAL_VERSION_T *res = (RES_BAT_PROTOCAL_VERSION_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery protocal version len %d version %d.%d.%d\r\n",
				res->ver_len, res->ver[0], res->ver[1], res->ver[2]);
			memcpy(&br_pro_vers, res, sizeof(RES_BAT_PROTOCAL_VERSION_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_PROT_VERS);
			break;
		}
		case RES_BAT_PASSWD_CHKSUM:
		{
			if (payload_len != sizeof(RES_BAT_PASSWD_CHKSUM_T)) {
				goto WRONG_PAYLOAD_LEN;
			}
			RES_BAT_PASSWD_CHKSUM_T *res = (RES_BAT_PASSWD_CHKSUM_T *)(pt + sizeof(MSG_UART_HEAD_T));
			dzlog_debug("++++++battery crc 0x%02x 0x%02x\r\n", res->crc[0], res->crc[1]);
			memcpy(&br_psw_chk, res, sizeof(RES_BAT_PASSWD_CHKSUM_T));
			xEventGroupSetBits(BatteryResEvents, BAT_EVT_PSW_CHKSUM);
			break;
		}

		default:
			break;
	}

FREE:
	jd_om_free(pt);
	return 0;

WRONG_PAYLOAD_LEN:
	dzlog_error("payload len dismatch type\r\n");
	jd_om_free(pt);
	return 0;
}

#if 0

		//recevicing file here.
		case REQ_TRANS_FILE_HEAD:
		{
			REQ_TRANS_FILE_HEAD_T *req = (REQ_TRANS_FILE_HEAD_T *)(pt + sizeof(MSG_UART_HEAD_T));
			if(strlen(recv_file_des.file_path)>0){
				dzlog_error("###############last transfer file '%s' not closed#############\r\n",
					recv_file_des.file_path);
				f_sync(&(recv_file_des.file_handle));
				f_close(&(recv_file_des.file_handle));
			}
			memset(recv_file_des.version,0,4);
			memset(recv_file_des.file_path, 0, MAX_FILE_PATH_SIZE);
			memset(recv_file_des.md5, 0, MD5_SIZE);
			memcpy(recv_file_des.md5, req->md5, MD5_SIZE);
			recv_file_des.size = req->size;
			recv_file_des.type = req->type;
			recv_file_des.aes_padding_len = 0;	//init aes padding length.
			old_pkt_id = 1;
			if((recv_file_des.type == voice_file) && (!ends_with(req->file_name,".mp3"))){
				dzlog_error("voice type mismatch with file name '%s'###\r\n",req->file_name);
			}
			else{
				jd_master_com_send_play_msg(hdl,type,(void *)req);
				file_transfer_start(hdl,req->file_name);
				*trans_timeout_cnt = 0;
				*file_trans = true;
				has_send_res = true;
			}
			break;
		}

		case REQ_TRANS_FILE_DATA:
		{
			REQ_TRANS_FILE_DATA_T *req = (REQ_TRANS_FILE_DATA_T *)(pt + sizeof(MSG_UART_HEAD_T));
			if (old_pkt_id != req->packet_id) {
				old_pkt_id = req->packet_id;
				file_transfer_going(hdl,req->packet_id, (char *)&(req->packet_id) + 4, payload_len - 4);
				*trans_timeout_cnt = 0;
				has_send_res = true;
			}
			else{
				dzlog_error("recv a same fragment id=%d\r\n",old_pkt_id);
			}
			break;
		}

		case REQ_TRANS_FILE_END:
		{
			file_transfer_end(hdl);
			*trans_timeout_cnt = 0;
			has_send_res = true;
			break;
		}

		case REQ_NOTIFY_ALL_FILE_COMPLETED:
		{
			RES_NOTIFY_ALL_FILE_COMPLETED_T res;

			//send to play task to process
			jd_master_com_send_play_msg(hdl,type,NULL);
			//send response to host
			res.code = 0;
			jd_master_com_send_response(hdl,type,(void *)&res);
			*trans_timeout_cnt = 0;
			*file_trans = false;
			has_send_res = true;
			break;
		}

		default:
			break;
	}
#endif

void uart_recv_queue_task(void const *p)
{
	jd_om_comm *hdl = (jd_om_comm *)p;
	void *pt = NULL;
	unsigned int disconnect_cnt = 0,lose_times = 0;
	unsigned int loseMaximumSec = 0;
	bool ever_disconnect_notify = false;
	//REQ_SHOW_T req;
	bool fileTransering = false;
	UINT fileTransTimeCnt = 0;

	dzlog_info("%s start\r\n", __func__);

	while (1) {
		//daemon_flag_clear(uart_daemon);
		//dzlog_debug("%s:@@1@@\r\n",__func__);
		jd_om_mq_recv(&(uart_comm_des.recv_queue), (void **)&pt, 1000/*millisecond timeout*/);

