zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
		//dzlog_debug("%s:##2##\r\n",__func__);
		#if 0
		if(fileTransering){
			if(fileTransTimeCnt++>50){
				//we've too much time not received host data transfer,so force to interrupt it.
				dzlog_debug("uart_recv_queue_task>>>wait data transfer timeout,force to interrupt it!!!\r\n");
				jd_master_com_send_play_msg(hdl,REQ_NOTIFY_ALL_FILE_COMPLETED,NULL);
				fileTransering = false;
				fileTransTimeCnt = 0;
			}
		}
		#endif

		if(pt == NULL){
			//printf("%s:%d\r\n", __func__, __LINE__);
			//dzlog_error("%s: timeout\r\n",__func__);
			if(lose_times>0)
				loseMaximumSec = 420;	// seconed time or later detection:5 minutes + 2 minutes alarm.
			else
				loseMaximumSec = 300;	// first time detection:5 minutes timeout.
			if(disconnect_cnt++ >= loseMaximumSec){	// only trigger one time.
				//dzlog_debug("%s:##lose connect %d seconds with host##\r\n",__func__,loseMaximumSec);
				//req.service_code = srv_code_connect_fail;
				//req.keep_alive = 0;
				//jd_master_com_send_play_msg(hdl,REQ_SHOW,&req);
				ever_disconnect_notify = true;
				disconnect_cnt = 0;	//stop counter
				lose_times++;
			}
		}
		else{
			if(ever_disconnect_notify){
				//req.service_code = srv_code_default;
				//req.keep_alive = 5;
				//jd_master_com_send_play_msg(hdl,REQ_SHOW,&req);
				ever_disconnect_notify = false;
			}
			disconnect_cnt = 0;	//stop counter
			lose_times = 0;
			if(strncmp((char *)pt,ReqNameByAT,strlen(ReqNameByAT))==0){
				dzlog_debug("%s:recv req AT name\r\n",__func__);
				jd_om_free(pt);
			}
			else{
				recv_data_dispatch(hdl,(char *)pt,&fileTransering,&fileTransTimeCnt);
			}
		}
	}
}

void uart_send_queue_task(void const *p)
{
	jd_om_comm *hdl = 0;//(jd_om_comm *)p;
	int slave = SLAVE_1;
	int ret;
	int lens;
	void *pt = NULL;
	jd_om_comm_addr to_addr;
	char slave_addr[16] = { 0 };
	int cnt_resend = 0;
	//int send_err = 0;
	unsigned char active_req = 0;

	dzlog_info("%s start\r\n", __func__);

	//char buf[128];
	static u32 num_ok = 0, num_fail = 0;
#if 0
	while(1) {
		//osDelay(1000);
		//jz_uart_write_ex(0, "hello\r\n", 7, 1000);
		memset(buf, 128, 0);
		ret = jz_uart_read_ex(0, buf, 128, 1000);
		if (ret)
			print_hex((char *)__func__,buf, ret);
			//printf("recv : %s\r\n", buf);
		else
			printf("recv no data\r\n");
	}
#endif
	while (1) {
		MSG_UART_HEAD_T *head = NULL;
		char res;
		jd_om_mq_recv(&(uart_comm_des.send_queue), (void **)&pt, 0);
		if(pt == NULL){
			dzlog_error("%s: invalid message: NULL\r\n",__func__);
			continue;
		}

		head = (MSG_UART_HEAD_T *)pt;
		lens = sizeof(MSG_UART_HEAD_T) + head->payload_len + CHECKSUM_SIZE;
		//print_hex((char *)__func__,pt, lens);
		res = head->type;
		slave = head->slave;
		sprintf(slave_addr, "0.%d.0", slave);
		to_addr.addr = tlc_iaddr(slave_addr);

#if 1
		mutex_uart_switch(slave);
		hdl = &uart_channels[slave];
#else
		hdl = mutex_uart_switch(slave);
		if (NULL == hdl) {
			printf("uart switch err\r\n");
			goto SEND_FREE;
		}
#endif

		switch (get_cmd_typte(res)) {
			case TYPE_INVALID:
			{
				dzlog_error("invalid type 0x%02x\n", res);
				jd_om_free(pt);
				continue;
			}
			case TYPE_RES:
			{
				ret = jd_om_send(hdl, &to_addr, pt, lens, 0);
				if (ret <= 0)
					dzlog_error("send to batt uart fail\n");
				continue;
			}
			case TYPE_REQ:
				goto SEND_REQ;
			default:
				break;
		}

SEND_REQ:
		active_req = head->type;
		//set_active_req(head->type);
		cnt_resend = 1;

RESEND_DATA:
		set_active_res(0);

		active_req = head->type;

		dzlog_debug("send msg\r\n");

		//print_hex((char *)__func__, pt, lens);
		ret = jd_om_send(hdl, &to_addr, pt, lens, 0);
		if (ret <= 0) {
			num_fail++;
			dzlog_error("send fail count %d\r\n", cnt_resend);
			if (res == REQ_TRANS_FILE_DATA) {
				if (cnt_resend++ <= 3) {
					osDelay(2000);
					goto RESEND_DATA;
				}
			}
		} else {
			if (1 == wait_response(active_req))
				dzlog_error("response time out>>>>>>\n");
			num_ok++;
		}

		dzlog_debug("send %d err/ok : %d/%d\r\n", lens, num_fail, num_ok);
		set_active_res(0xa0 | (0xf & active_req));
SEND_FREE:
		jd_om_free(pt);
	}
}





/*!
 * @brief uart receive Task responsible for loopback.
 */
void uart_recv_task(void const *p)
{
	jd_om_comm *uart_hdl = (jd_om_comm *)p;
	int r_len;
	jd_om_comm_addr from_addr;
	char buf[MAX_QUEUE_ELEMENT_SIZE] = { 0 };
	char *pt;
	dzlog_info("uart_recv_task start>>>\r\n");

	//task of receving.
	while (1) {
		memset(buf, 0, MAX_QUEUE_ELEMENT_SIZE);
//		uart_hdl = &uart_channels[get_uart_channel()];
//		printf("recv hdl 0x%x uart2 0x%x uart6 0x%x\r\n", uart_hdl->ptlc->pllc->fd, uart_channels[0].ptlc->pllc->fd, uart_channels[1].ptlc->pllc->fd);
		r_len = jd_om_recv(uart_hdl, &from_addr, buf, MAX_QUEUE_ELEMENT_SIZE);
		if (0 == r_len)
			continue;

		if ((r_len > sizeof(MSG_UART_HEAD_T)) ||
			((r_len == strlen(ReqNameByAT)) && (strncmp(buf,ReqNameByAT,r_len)==0))) {
			//print_hex((char *)__func__,buf, r_len);
			pt = jd_om_malloc(r_len);
			memcpy(pt, buf, r_len);
			jd_om_mq_send(&(uart_comm_des.recv_queue), pt);
			//dzlog_debug("%s:send recv queue end...\r\n",__func__);
		}
		else{
			dzlog_error("recv msg from uart. invalid len:%d\r\n", r_len);
		}
	}
}

#if 0
void eeprom_setting_show_test(void)
{
	uint32_t eeprom_data = 0xFFFFFFFFU;
	int i=0;

	dzlog_info("\r\n");
	for(i=0;i<(EEPROM_ADDR_END/4);i++){
		eeprom_data = *((uint32_t *)(FSL_FEATURE_EEPROM_BASE_ADDRESS + (i*4)));
		dzlog_info("%s::::::[%02x %02x %02x %02x][byte %d]\r\n",__func__,
			(eeprom_data>>24)&0xFF,
			(eeprom_data>>16)&0xFF,
			(eeprom_data>>8)&0xFF,
			eeprom_data&0xFF,
			i*4);
	}
}
#endif


#ifdef AES_CBC_256_DBG
static void aes_cbc_encrypt_desrypt_testing(char *in_string)
{
	uint8_t key[] = { 0x60, 0x3d, 0xeb, 0x10, 0x15, 0xca, 0x71, 0xbe, 0x2b, 0x73, 0xae, 0xf0, 0x85, 0x7d, 0x77, 0x81,
					  0x1f, 0x35, 0x2c, 0x07, 0x3b, 0x61, 0x08, 0xd7, 0x2d, 0x98, 0x10, 0xa3, 0x09, 0x14, 0xdf, 0xf4 };
	unsigned char iv[AES_BLOCKLEN];		 // init vector
	struct AES_ctx ctx;
	unsigned char *in;
	unsigned int len;		 // encrypt length (in multiple of AES_BLOCK_SIZE)
	unsigned char padding_len = 0;
	int i;

	dzlog_info("################aes_cbc test start################\r\n");
	dzlog_info("input string: [len=%d,%s]\r\n",strlen(in_string),in_string);
	len = 0;
	/*
	padding PKCS7 is recommendable.
	01
	02 02
	03 03 03
	04 04 04 04
	05 05 05 05 05
	06 06 06 06 06 06
	etc.
	*/
	if ((strlen(in_string) + 1) % AES_BLOCKLEN == 0) {
		len = strlen(in_string) + 1;
	} else {
		len = ((strlen(in_string) + 1) / AES_BLOCKLEN + 1) * AES_BLOCKLEN;
	}

