zhaofeng0327/stm32f7/A1902/fml/uart/uart_comm.c
	 padding_len = len-strlen(in_string);

	// set the input string
	in = (unsigned char*)jd_om_malloc(len);
	if (in == NULL) {
		dzlog_error("Unable to allocate memory for input_string\r\n");
		return;
	}
	memset(in,padding_len,len);
	strncpy((char*)in, in_string, strlen(in_string));

   dzlog_info("original string hex[len=%d,padding_len=%d]: \r\n",len,padding_len);
   for(i=0;i<len;i++){
	dzlog_info("%02x ",(unsigned char)in[i]);
	if((i+1)%16==0)
		dzlog_info("\r\n");
   }
   //dzlog_info("\r\n");

	//encrypt start(iv will change)
	for (i=0; i<AES_BLOCKLEN; ++i) {
		iv[i] = 0;
	}
	AES_init_ctx_iv(&ctx, key, iv);
	AES_CBC_encrypt_buffer(&ctx, in, len);
	dzlog_info("CBC encrypted hex[len=%d]: \r\n",len);
   for(i=0;i<len;i++){
	dzlog_info("%02x ",(unsigned char)in[i]);
	if((i+1)%16==0)
		dzlog_info("\r\n");
   }
   //dzlog_info("\n");

   //decrypt start(iv will change)
	for (i=0; i<AES_BLOCKLEN; ++i) {
		iv[i] = 0;
	}
   AES_init_ctx_iv(&ctx, key, iv);
   AES_CBC_decrypt_buffer(&ctx, in, len);
   dzlog_info("CBC decrypted hex: \r\n");
   for(i=0;i<len;i++){
	dzlog_info("%02x ",(unsigned char)in[i]);
	if((i+1)%16==0)
		dzlog_info("\r\n");
   }
   //real data after trim the padding
   padding_len = in[len-1];
   len -= padding_len;
   dzlog_info("CBC decrypted hex after trim padding: \r\n");
   for(i=0;i<len;i++){
	dzlog_info("%02x ",(unsigned char)in[i]);
	if((i+1)%16==0)
		dzlog_info("\r\n");
   }
   dzlog_info("\r\n");
   memset(&(in[len]),0,padding_len);

   dzlog_info("CBC decrypted string: [%s]\r\n",in);
   dzlog_info("################aes_cbc test end################\r\n");
   jd_om_free(in);
}
#endif


int stop_uart_service()
{

#if 1
	for (int i = 0; i < UART_CNT; i++) {
		osThreadTerminate(uart_comm_des.thread_uart_recv[i]);
	}

#else
	for (int i = 0; i < UART_COM_MAX; i++) {
		if (uart_comm_des.thread_uart_recv[i]) {
		osThreadTerminate(uart_comm_des.thread_uart_recv[i]);
			uart_comm_des.thread_uart_recv[i] = 0;
		}
	}
#endif

	osThreadTerminate(uart_comm_des.thread_handle_send);
	osThreadTerminate(uart_comm_des.thread_handle_recv);

#if 1
	for (int i=0; i < UART_CNT; i++) {
		if (uart_channels[i].ptlc)
			jd_om_comm_close(&uart_channels[i]);
	}
#else
	for (int i=0; i < UART_COM_MAX; i++) {
		if (uart_comms[i].ptlc)
			jd_om_comm_close(&uart_comms[i]);
	}
#endif

	jd_om_delete_mq(&(uart_comm_des.recv_queue));
	jd_om_delete_mq(&(uart_comm_des.send_queue));
	jd_om_mutex_delete(&uart_comm_des.mutex_active_req);
	jd_om_mutex_delete(&uart_comm_des.mutex_active_res);
	jd_om_mutex_delete(&mutex_channel_select);
	vEventGroupDelete(BatteryResEvents);

	return 0;
}

int start_uart_service()
{
	int ret = 0;
	jd_om_comm_addr local_addr;
	jd_om_comm_addr addr_mask;

	if(jd_om_mq_create(&(uart_comm_des.send_queue),MAX_QUEUE_SIZE) != osOK){
		dberr("create send queue fail.\r\n");
		return -1;
	}

	if(jd_om_mq_create(&(uart_comm_des.recv_queue),MAX_QUEUE_SIZE) != osOK){
		dberr("create recv queue fail.\r\n");
		return -1;
	}

	if (jd_om_mutex_create(&(uart_comm_des.mutex_active_req)) != osOK){
		dzlog_error("mutex_active_req init error\r\n");
		vTaskSuspend(NULL);
	}

	if (jd_om_mutex_create(&(uart_comm_des.mutex_active_res)) != osOK){
		dzlog_error("mutex_active_res init error\r\n");
		vTaskSuspend(NULL);
	}

	if (jd_om_mutex_create(&(mutex_channel_select)) != osOK){
		dzlog_error("mutex_chanel_select init error\r\n");
		vTaskSuspend(NULL);
	}



	BatteryResEvents = xEventGroupCreate();
	if (NULL == BatteryResEvents) {
		dzlog_error("create battery events error\r\n");
		vTaskSuspend(NULL);
	}

#if 0
	//get communication cipher.
	memset(uart_hdl->cipher,0,sizeof(uart_hdl->cipher));
	jd_master_com_get_communication_cipher(sizeof(uart_hdl->cipher),uart_hdl->cipher);
#endif





	//printf("uart4 0x%x uart6 0x%x\r\n", uart_channels[0].ptlc->pllc->fd, uart_channels[1].ptlc->pllc->fd);

#if 1


	//start_factory_test_service();


	/* definition and creation of uartSendQueueTask */
	osThreadDef(uartSendQueueTask, uart_send_queue_task, osPriorityNormal, 0, 1024);
	uart_comm_des.thread_handle_send = osThreadCreate(osThread(uartSendQueueTask), 0);
	if(uart_comm_des.thread_handle_send == NULL){
		printf("create send thread fail.\r\n");
		while (1)
			;
	} else {
		printf("Uart_send_queue_task create successful !\r\n");
	}

	/* definition and creation of uartRecvQueueTask */
	osThreadDef(uartRecvQueueTask, uart_recv_queue_task, osPriorityNormal, 0, 5120);
	uart_comm_des.thread_handle_recv = osThreadCreate(osThread(uartRecvQueueTask), 0);
	if(uart_comm_des.thread_handle_recv == NULL){
		printf("create recv thread fail.\r\n");
		while (1);
	} else {
		printf("Uart_recv_queue_task create successful !\r\n");
	}


	start_factory_test_service();

	local_addr.addr = tlc_iaddr("1.0.0");
	addr_mask.addr = tlc_iaddr("255.0.0");
	ret = jd_om_comm_open(&uart_channels[1], &local_addr, &addr_mask, 6);
	if (0 != ret) {
		dzlog_error("open uart number %d fail ret %d.\r\n", 4, ret);
		vTaskSuspend(NULL);
	}


	THREAD_DEF(uartRecv, 1, uart_recv_task, osPriorityNormal, 0, 1024);
	uart_comm_des.thread_uart_recv[1] = osThreadCreate(TRHEAD_NAME_ID(uartRecv, 1), &uart_channels[1]);
	if (NULL == uart_comm_des.thread_uart_recv[1]) {
		printf("create Uart recv Task %d failed!.\r\n", 1);
		while (1);
	} else {
		printf("Uart recv task %d create successful !\r\n", 1);
	}



#if 0
	printf("remember only one recv task\r\n");
	/* definition and creation of uartRecv */
	for (int i = 0; i < UART_CNT; i++) {
		THREAD_DEF(uartRecv, i, uart_recv_task, osPriorityNormal, 0, 1024);
		uart_comm_des.thread_uart_recv[i] = osThreadCreate(TRHEAD_NAME_ID(uartRecv, i), &uart_channels[i]);
		if (NULL == uart_comm_des.thread_uart_recv[i]) {
			printf("create Uart recv Task %d failed!.\r\n", i);
			while (1);
		} else {
			printf("Uart recv task %d create successful !\r\n", i);
		}
	}
#endif

#else
	osThreadDef(uartTask, uart_task, osPriorityNormal, 0, 5120);
	if (NULL == osThreadCreate(osThread(uartTask), uart_hdl)) {
		printf("create Uart Task failed!.\r\n");
		while (1);
	} else {
		printf("Uart task create successful !\r\n");
	}
#endif

#ifdef AES_CBC_256_DBG
	aes_cbc_encrypt_desrypt_testing("123456789012345");		//15 bytes
	aes_cbc_encrypt_desrypt_testing("1234567890123456");	//16 bytes
	aes_cbc_encrypt_desrypt_testing("12345678901234567");	//17 bytes
#endif


	return 0;
}

//HOOK function to detect task stack overflow!
void vApplicationStackOverflowHook( TaskHandle_t xTask, signed char *pcTaskName )
{
     dzlog_error("task:[%s] ######stack overflow######\r\n", pcTaskName);
}


